---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.HandrailSupportsNumberParam
source: html/2e01e501-ffef-074a-ab9c-940c139f7831.htm
---
# Autodesk.Revit.DB.ParameterTypeId.HandrailSupportsNumberParam Property

"Number"

## Syntax (C#)
```csharp
public static ForgeTypeId HandrailSupportsNumberParam { get; }
```